{
    "common": {
        "name": "robonect",
        "version": "1.3.3",
        "news": {
            "1.3.3": {
                "en": "Chg: massive code refactoring\nFix: Fixed false error message when PushService is listening to all IPv4 or IPv6 addresses\nChg: Forcing pollType info for pushService when enabled it's enabled in config",
                "de": "Änderung: Massives Code-Refactoring\nFix: Falsche Fehlermeldung behoben, wenn PushService alle IPv4- oder IPv6-Adressen abhört\nÄnderung: PollType-Informationen für pushService werden erzwungen, wenn diese in der Konfiguration aktiviert sind",
                "ru": "Измен.: масштабный рефакторинг кода. \n Исправлено: исправлено ложное сообщение об ошибке, когда PushService прослушивает все адреса IPv4 или IPv6. \n Изм.: принудительное использование информации pollType для pushService, когда она включена, она включена в конфигурации.",
                "pt": "Alteração: refatoração massiva de código\n Correção: Corrigida mensagem de erro falsa quando PushService está escutando todos os endereços IPv4 ou IPv6\n Alteração: Forçando informações pollType para pushService quando ativado, está ativado na configuração",
                "nl": "Chg: grootschalige code-refactoring\nFix: foutieve foutmelding opgelost wanneer PushService naar alle IPv4- of IPv6-adressen luistert\nChg: PollType-informatie voor pushService forceren wanneer deze is ingeschakeld in de configuratie",
                "fr": "Chg : refactorisation massive du code\nCorrection : correction d'un faux message d'erreur lorsque PushService écoute toutes les adresses IPv4 ou IPv6\nChg : forcer les informations pollType pour pushService lorsqu'il est activé, il est activé dans la configuration",
                "it": "Modifica: refactoring massiccio del codice\nCorrezione: risolto il falso messaggio di errore quando PushService è in ascolto su tutti gli indirizzi IPv4 o IPv6\nModifica: forzatura delle informazioni pollType per pushService quando abilitato è abilitato nella configurazione",
                "es": "Chg: refactorización masiva de código\n Solución: se corrigió el mensaje de error falso cuando PushService escucha todas las direcciones IPv4 o IPv6\n Chg: Forzar la información pollType para pushService cuando está habilitado, está habilitado en la configuración",
                "pl": "Chg: masowa refaktoryzacja kodu\nPoprawka: Naprawiono fałszywy komunikat o błędzie, gdy PushService nasłuchuje wszystkich adresów IPv4 lub IPv6\nChg: Wymuszanie informacji typu pollType dla usługi pushService, gdy jest włączona, jest włączona w konfiguracji",
                "uk": "Зміна: масовий рефакторинг коду\nВиправлення: виправлено помилкове повідомлення про помилку, коли PushService прослуховує всі адреси IPv4 або IPv6\nЗміна: примусове використання інформації pollType для pushService, коли її ввімкнено в конфігурації",
                "zh-cn": "Chg：大规模代码重构\n修复：修复了 PushService 侦听所有 IPv4 或 IPv6 地址时的错误消息\nChg：在启用时强制推送服务的 pollType 信息（在配置中启用）"
            },
            "1.3.2": {
                "en": "Fix: Switching of extensions works now\nFix: Fixed false error message when switching extensions",
                "de": "Fix: Das Umschalten von Erweiterungen funktioniert jetzt\nFix: Falsche Fehlermeldung beim Umschalten von Erweiterungen behoben",
                "ru": "Исправлено: переключение расширений теперь работает\nИсправлено: исправлено ложное сообщение об ошибке при переключении расширений.",
                "pt": "Correção: a troca de extensões funciona agora\n Correção: corrigida a falsa mensagem de erro ao trocar de extensões",
                "nl": "Fix: wisselen van extensie werkt nu\nFix: foutieve foutmelding opgelost bij het wisselen van extensie",
                "fr": "Correctif : le changement d'extension fonctionne maintenant\nCorrection : correction d'un faux message d'erreur lors du changement d'extension",
                "it": "Correzione: il cambio di estensione ora funziona\nCorrezione: corretto il messaggio di errore falso quando si cambia estensione",
                "es": "Solución: el cambio de extensiones funciona ahora \n Solución: se corrigió un mensaje de error falso al cambiar de extensión",
                "pl": "Poprawka: przełączanie rozszerzeń działa teraz \n Poprawka: naprawiono fałszywy komunikat o błędzie podczas przełączania rozszerzeń",
                "uk": "Виправлення: перемикання розширень працює зараз\nВиправлення: виправлено помилкове повідомлення про помилку під час перемикання розширень",
                "zh-cn": "修复：现在可以切换扩展程序\n修复：修复切换扩展程序时出现的错误消息"
            },
            "1.3.1": {
                "en": "Chg: removed unnecessary Info log entries",
                "de": "Änderung: unnötige Info-Log-Einträge entfernt",
                "ru": "Измен.: удалены ненужные записи журнала информации.",
                "pt": "Chg: foram removidas entradas desnecessárias do log de informações",
                "nl": "Chg: onnodige Info-logboekvermeldingen verwijderd",
                "fr": "Chg : suppression des entrées inutiles du journal d'informations",
                "it": "Modifica: rimosse le voci del registro informazioni non necessarie",
                "es": "Cambio: se eliminaron entradas innecesarias del registro de información",
                "pl": "Zmień: usunięto niepotrzebne wpisy dziennika informacyjnego",
                "uk": "Зміна: видалено непотрібні записи журналу інформації",
                "zh-cn": "Chg：删除了不必要的信息日志条目"
            },
            "1.3.0": {
                "en": "Chg: Changed authentication method from URL-Encoding to basic authentication\nImproved error handling\nUpd: Dependencies got updated",
                "de": "Änderung: Authentifizierungsmethode von URL-Verschlüsselung auf Basisauthentifizierung geändert\nFehlerbehandlung verbessert\nAktualisiert: Abhängigkeiten wurden aktualisiert",
                "ru": "Изменение: изменен метод аутентификации с URL-кодирования на базовую аутентификацию \n Улучшена обработка ошибок \n Обновление: обновлены зависимости.",
                "pt": "Chg: Método de autenticação alterado de codificação de URL para autenticação básica\n Melhor tratamento de erros\n Atualização: Dependências foram atualizadas",
                "nl": "Chg: Gewijzigde authenticatiemethode van URL-codering naar basisauthenticatie\nVerbeterde foutafhandeling\nUpd: Afhankelijkheden zijn bijgewerkt",
                "fr": "Chg : modification de la méthode d'authentification de l'encodage d'URL à l'authentification de base\nGestion des erreurs améliorée\nMise à jour : les dépendances ont été mises à jour",
                "it": "Modifica: metodo di autenticazione modificato dalla codifica URL all'autenticazione di base\nGestione degli errori migliorata\nAggiornamento: le dipendenze sono state aggiornate",
                "es": "Cambio: Se cambió el método de autenticación de codificación de URL a autenticación básica \n Manejo de errores mejorado \n Actualización: Se actualizaron las dependencias",
                "pl": "Chg: Zmieniono metodę uwierzytelniania z kodowania URL na uwierzytelnianie podstawowe \n Poprawiona obsługa błędów \n Aktualizacja: Zależności zostały zaktualizowane",
                "uk": "Зміна: метод автентифікації змінено з URL-кодування на базову автентифікацію\nПокращена обробка помилок\nОновлено: залежності оновлено",
                "zh-cn": "Chg：将身份验证方法从 URL 编码更改为基本身份验证\n改进了错误处理\nUpd：更新了依赖项"
            },
            "1.2.0": {
                "en": "(mcm1957) Fix: Adapter requires NodeJs >= 16\n(crocri)  New: Introduced code to clear errors\n (grizzelbee) Fix: Fixed functions getValueAsync() and testPushServerConfig()",
                "de": "(mcm1957) Fix: Adapter erfordert NodeJs >= 16\n(crocri) Neu: Code zum Löschen von Fehlern eingeführt\n (grizzelbee) Fix: Funktionen getValueAsync() und testPushServerConfig() korrigiert",
                "ru": "(mcm1957) Исправлено: адаптер требует NodeJs >= 16\n(crocri). Новое: введен код для очистки ошибок\n (grizzelbee). Исправлено: исправлены функции getValueAsync() и testPushServerConfig().",
                "pt": "(mcm1957) Correção: o adaptador requer NodeJs >= 16\n(crocri) Novo: código introduzido para limpar erros\n (grizzelbee) Correção: funções corrigidas getValueAsync() e testPushServerConfig()",
                "nl": "(mcm1957) Oplossing: Adapter vereist NodeJs >= 16\n(crocri) Nieuw: Code geïntroduceerd om fouten te wissen\n (grizzelbee) Oplossing: Functies getValueAsync() en testPushServerConfig() opgelost",
                "fr": "(mcm1957) Correctif : l'adaptateur nécessite NodeJs >= 16\n(crocri) Nouveau : code introduit pour effacer les erreurs\n (grizzelbee) Correctif : fonctions fixes getValueAsync() et testPushServerConfig()",
                "it": "(mcm1957) Correzione: l'adattatore richiede NodeJs >= 16\n(crocri) Novità: introdotto codice per cancellare errori\n (grizzelbee) Correzione: corrette le funzioni getValueAsync() e testPushServerConfig()",
                "es": "(mcm1957) Solución: El adaptador requiere NodeJs >= 16\n(crocri) Nuevo: Código introducido para borrar errores\n (grizzelbee) Solución: Funciones fijas getValueAsync() y testPushServerConfig()",
                "pl": "(mcm1957) Poprawka: Adapter wymaga NodeJs >= 16\n(crocri) Nowość: Wprowadzono kod do usuwania błędów\n (grizzelbee) Poprawka: Naprawiono funkcje getValueAsync() i testPushServerConfig()",
                "uk": "(mcm1957) Виправлення: для адаптера потрібні NodeJs >= 16\n(crocri) Нове: представлено код для видалення помилок\n (grizzelbee) Виправлення: виправлено функції getValueAsync() і testPushServerConfig()",
                "zh-cn": "(mcm1957) 修复：适配器需要 NodeJs >= 16\n(crocri) 新增：引入了清除错误的代码\n (grizzelbee) 修复：修复了函数 getValueAsync() 和 testPushServerConfig()"
            },
            "1.1.5": {
                "en": "Command-URL was invalid when Robonect UI wasn't protected by username and password\nminor code refactoring",
                "de": "Die Befehls-URL war ungültig, wenn die Robonect-Benutzeroberfläche nicht durch Benutzername und Passwort geschützt war\nGeringfügige Code-Umgestaltung",
                "ru": "URL-адрес команды недействителен, когда пользовательский интерфейс Robonect не был защищен именем пользователя и паролем\nнезначительный рефакторинг кода",
                "pt": "O URL do comando era inválido quando a UI do Robonect não estava protegida por nome de usuário e senha\nrefatoração de código secundária",
                "nl": "Command-URL was ongeldig toen de gebruikersinterface van Robonect niet werd beschermd door gebruikersnaam en wachtwoord\nrefactoring van kleine codes",
                "fr": "L'URL de commande n'était pas valide lorsque l'interface utilisateur de Robonect n'était pas protégée par le nom d'utilisateur et le mot de passe \n refactorisation mineure du code",
                "it": "L'URL del comando non era valido quando l'interfaccia utente di Robonect non era protetta dal refactoring del codice minore di nome utente e password",
                "es": "La URL de comando no era válida cuando la interfaz de usuario de Robonect no estaba protegida por nombre de usuario y contraseña\nrefactorización de código menor",
                "pl": "Adres URL polecenia był nieprawidłowy, gdy interfejs użytkownika Robonect nie był chroniony nazwą użytkownika i hasłem\nrefaktoryzacja drobnego kodu",
                "uk": "URL-адреса команди була недійсною, коли інтерфейс користувача Robonect не був захищений іменем користувача та паролем\nнезначним рефакторингом коду",
                "zh-cn": "当 Robonect UI 不受用户名和密码保护时，Command-URL 无效\n次要代码重构"
            },
            "1.1.4": {
                "en": "Fix: Attempting to fix the error: Cannot read properties of null (reading 'val')",
                "de": "Fix: Versuch, den Fehler zu beheben: Eigenschaften von Null können nicht gelesen werden (es wird „val“ gelesen)",
                "ru": "Исправлено: попытка исправить ошибку: невозможно прочитать свойства со значением null (чтение «val»).",
                "pt": "Correção: Tentativa de corrigir o erro: Não é possível ler propriedades de nulo (lendo 'val')",
                "nl": "Oplossing: poging om de fout op te lossen: kan eigenschappen van null niet lezen (leest 'val')",
                "fr": "Correctif : tentative de correction de l'erreur : impossible de lire les propriétés de null (lecture de 'val')",
                "it": "Correzione: tentativo di correggere l'errore: impossibile leggere le proprietà di null (lettura 'val')",
                "es": "Solución: intentando corregir el error: no se pueden leer las propiedades de nulo (leyendo 'val')",
                "pl": "Poprawka: próba naprawienia błędu: nie można odczytać właściwości null (czytanie „val”)",
                "uk": "Виправлення: спроба виправити помилку: неможливо прочитати властивості null (читання 'val')",
                "zh-cn": "修复：尝试修复错误：无法读取 null 的属性（读取“val”）"
            },
            "1.1.3": {
                "en": "New: Added release script for easier publishing to stable repo",
                "de": "Neu: Release-Skript zur einfacheren Veröffentlichung im Stable Repo hinzugefügt",
                "ru": "Новое: добавлен скрипт выпуска для упрощения публикации в стабильном репозитории.",
                "pt": "Novo: Adicionado script de lançamento para publicação mais fácil em repositório estável",
                "nl": "Nieuw: Releasescript toegevoegd voor eenvoudiger publiceren naar stabiele opslagplaats",
                "fr": "Nouveau : ajout d'un script de publication pour une publication plus facile sur un dépôt stable",
                "it": "Novità: aggiunto script di rilascio per una pubblicazione più semplice su repository stabili",
                "es": "Nuevo: Se agregó un script de lanzamiento para facilitar la publicación en el repositorio estable.",
                "pl": "Nowość: Dodano skrypt wydania dla łatwiejszego publikowania w stabilnym repozytorium",
                "uk": "Нове: додано сценарій випуску для легшої публікації в стабільному репо",
                "zh-cn": "新增内容：添加了发布脚本，以便更轻松地发布到稳定的存储库"
            },
            "1.1.1": {
                "en": "Fix: Fixed status.stopped for push messages.",
                "de": "Fix: Status.stopped für Push-Nachrichten behoben.",
                "ru": "Исправлено: исправлен статус status.stopped для push-сообщений.",
                "pt": "Correção: Corrigido status.stopped para mensagens push.",
                "nl": "Fix: Vaste status. Gestopt voor push-berichten.",
                "fr": "Correctif : Correction du statut arrêté pour les messages push.",
                "it": "Correzione: corretto status.stopped per i messaggi push.",
                "es": "Solución: estado fijo. Detenido para mensajes push.",
                "pl": "Poprawka: Naprawiono status zatrzymany dla wiadomości push.",
                "uk": "Виправлення: виправлено status.stopped для push-повідомлень.",
                "zh-cn": "修复：修复推送消息的 status.stopped。"
            },
            "1.1.0": {
                "en": "Fix: Showing values for battery with fractions (again)\nNew: Added START button\nNew: Added STOP button\nNew: Added SERVICE button to reboot, shutdown or sleep Robonect module\nNew: Push states and interval can be set\nNew: Nickname of the mower can be set\nNew: Timers of the mower can be set ",
                "de": "Behoben: Werte für Batterie werden (wieder) mit Brüchen angezeigt\nNeu: START-Taste hinzugefügt\nNeu: STOP-Taste hinzugefügt\nNeu: SERVICE-Taste hinzugefügt, um das Robonect-Modul neu zu starten, herunterzufahren oder in den Ruhezustand zu versetzen\nNeu: Push-Zustände und Intervall können eingestellt werden\nNeu: Spitzname des Mähers kann eingestellt werden\nNeu: Timer des Mähers können eingestellt werden",
                "ru": "Исправлено: Отображение значений батареи с дробями (снова) \n Новое: добавлена ​​кнопка START \n Новое: добавлена ​​кнопка STOP \n Новое: добавлена ​​кнопка SERVICE для перезагрузки, выключения или перехода в спящий режим модуля Robonect \n Новое: можно установить состояния и интервал нажатия \n Новое: Можно установить имя косилки. \nНовое: можно установить таймеры косилки.",
                "pt": "Correção: Mostrando valores para bateria com frações (novamente)\nNovo: Adicionado botão START\nNovo: Adicionado botão STOP\nNovo: Adicionado botão SERVICE para reiniciar, desligar ou suspender o módulo Robonect\nNovo: Estados de push e intervalo podem ser definidos\nNovo: O apelido do cortador pode ser definido\nNovo: Os temporizadores do cortador podem ser definidos",
                "nl": "Fix: waarden voor batterij met breuken (opnieuw) tonen\nNieuw: START-knop toegevoegd\nNieuw: STOP-knop toegevoegd\nNieuw: SERVICE-knop toegevoegd om de Robonect-module opnieuw op te starten, uit te schakelen of te slapen\nNieuw: Push-statussen en interval kunnen worden ingesteld\nNieuw: Bijnaam van de maaier kan worden ingesteld\nNieuw: Timers van de maaier kunnen worden ingesteld",
                "fr": "Correction : affichage des valeurs de la batterie avec des fractions (à nouveau)\nNouveau : bouton START ajouté\nNouveau : bouton STOP ajouté\nNouveau : bouton SERVICE ajouté pour redémarrer, arrêter ou mettre en veille le module Robonect\nNouveau : les états de poussée et l'intervalle peuvent être définis\nNouveau : Le surnom de la tondeuse peut être défini\nNouveau : les minuteries de la tondeuse peuvent être définies",
                "it": "Correzione: visualizzazione dei valori per la batteria con frazioni (di nuovo)\nNuovo: aggiunto pulsante START\nNuovo: aggiunto pulsante STOP\nNuovo: aggiunto pulsante SERVICE per riavviare, spegnere o sospendere il modulo Robonect\nNuovo: è possibile impostare gli stati di push e l'intervallo\nNuovo: È possibile impostare il soprannome del tagliaerba\nNuovo: è possibile impostare i timer del tagliaerba",
                "es": "Corrección: Mostrar valores para la batería con fracciones (nuevamente)\nNuevo: Botón INICIO agregado\nNuevo: Botón DETENER agregado\nNuevo: Botón SERVICIO agregado para reiniciar, apagar o suspender el módulo Robonect\nNuevo: Se pueden configurar estados de pulsación e intervalos\nNuevo: Se puede configurar el apodo del cortacésped \n Nuevo: se pueden configurar los temporizadores del cortacésped",
                "pl": "Poprawka: Wyświetlanie wartości baterii z ułamkami (ponownie) \n Nowość: Dodano przycisk START \n Nowość: Dodano przycisk STOP \n Nowość: Dodano przycisk SERVICE do ponownego uruchomienia, wyłączenia lub uśpienia modułu Robonect \n Nowość: Można ustawić stany push i interwał \n Nowość: Możliwość ustawienia pseudonimu kosiarki\nNowość: Możliwość ustawienia timerów kosiarki",
                "uk": "Виправлення: відображення значень для батареї з частками (знову)\nНове: додано кнопку СТАРТ\nНове: додано кнопку СТОП\nНове: додано кнопку СЕРВІС для перезавантаження, вимкнення або переходу в режим сну Robonect\nНове: стани натискання та інтервал можна встановити\nНове: Можна встановити псевдонім косарки\nНове: можна встановити таймери косарки",
                "zh-cn": "修复：再次显示带分数的电池值\n新功能：添加了“开始”按钮\n新功能：添加了“停止”按钮\n新功能：添加了用于重新启动、关闭或睡眠 Robonect 模块的“服务”按钮\n新功能：可以设置推送状态和间隔\n新功能：可设置割草机的昵称\n新增：可设置割草机的定时器"
            },
            "1.0.5": {
                "en": "Added new state #18 - Garage door is opening\nStatus.stopped gets correctly updated",
                "de": "Neuer Status Nr. 18 hinzugefügt – Garagentor öffnet sich\nStatus.stopped wird korrekt aktualisiert",
                "ru": "Добавлено новое состояние № 18 — Дверь гаража открывается \n Статус.остановлено корректно обновляется.",
                "pt": "Adicionado novo estado #18 - A porta da garagem está abrindo\nStatus.stopped é atualizado corretamente",
                "nl": "Nieuwe status #18 toegevoegd - Garagedeur gaat open\nStatus.stopped wordt correct bijgewerkt",
                "fr": "Ajout d'un nouvel état #18 - La porte de garage s'ouvre\nStatus.stopped est correctement mis à jour",
                "it": "Aggiunto il nuovo stato n. 18 - La porta del garage si sta aprendo\nStatus.stopped viene aggiornato correttamente",
                "es": "Se agregó un nuevo estado #18: La puerta del garaje se está abriendo\nEl estado.detenido se actualiza correctamente",
                "pl": "Dodano nowy stan nr 18 – Brama garażowa się otwiera.\nStatus.stopped zostaje poprawnie zaktualizowany",
                "uk": "Додано новий стан №18 - Двері гаража відчиняються\nStatus.stopped правильно оновлюється",
                "zh-cn": "添加了新状态 #18 - 车库门正在打开\nStatus.stopped 得到正确更新"
            },
            "1.0.4": {
                "en": "Improved error handling",
                "de": "Verbesserte Fehlerbehandlung",
                "ru": "Улучшена обработка ошибок",
                "pt": "Tratamento de erros aprimorado",
                "nl": "Verbeterde foutafhandeling",
                "fr": "Amélioration de la gestion des erreurs",
                "it": "Gestione degli errori migliorata",
                "es": "Manejo de errores mejorado",
                "pl": "Ulepszona obsługa błędów",
                "uk": "Покращена обробка помилок",
                "zh-cn": "改进了错误处理"
            },
            "1.0.3": {
                "en": "Improved error handling\nRenamed jsonConfig.json5 to jsonConfig.json to get better compatibility\nSome bug fixes",
                "de": "Verbesserte Fehlerbehandlung\nJsonConfig.json5 in jsonConfig.json umbenannt, um eine bessere Kompatibilität zu erreichen\nEinige Fehlerbehebungen",
                "ru": "Улучшена обработка ошибок \n Переименован jsonConfig.json5 в jsonConfig.json для лучшей совместимости \n Некоторые исправления ошибок",
                "pt": "Tratamento de erros aprimorado\nJsonConfig.json5 renomeado para jsonConfig.json para obter melhor compatibilidade\nAlgumas correções de bugs",
                "nl": "Verbeterde foutafhandeling \n Hernoemd jsonConfig.json5 naar jsonConfig.json voor betere compatibiliteit \n Enkele bugfixes",
                "fr": "Amélioration de la gestion des erreurs \n JsonConfig.json5 renommé en jsonConfig.json pour une meilleure compatibilité \n Quelques corrections de bogues",
                "it": "Gestione degli errori migliorata\n Rinominato jsonConfig.json5 in jsonConfig.json per ottenere una migliore compatibilità\n Alcune correzioni di bug",
                "es": "Manejo de errores mejorado\n Cambió el nombre de jsonConfig.json5 a jsonConfig.json para obtener una mejor compatibilidad\n Algunas correcciones de errores",
                "pl": "Ulepszona obsługa błędów \n Zmieniono nazwę jsonConfig.json5 na jsonConfig.json, aby uzyskać lepszą kompatybilność \n Niektóre poprawki błędów",
                "uk": "Покращена обробка помилок\nПерейменовано jsonConfig.json5 на jsonConfig.json для кращої сумісності\nДеякі виправлення помилок",
                "zh-cn": "改进了错误处理\n将 jsonConfig.json5 重命名为 jsonConfig.json 以获得更好的兼容性\n修复了一些错误"
            },
            "1.0.2": {
                "en": "Updated package.json to deliver jsonConfig.json5",
                "de": "package.json aktualisiert, um jsonConfig.json5 bereitzustellen",
                "ru": "Обновлен package.json для доставки jsonConfig.json5.",
                "pt": "Package.json atualizado para entregar jsonConfig.json5",
                "nl": "Bijgewerkt package.json om jsonConfig.json5 te leveren",
                "fr": "Mise à jour de package.json pour fournir jsonConfig.json5",
                "it": "Package.json aggiornato per fornire jsonConfig.json5",
                "es": "Package.json actualizado para entregar jsonConfig.json5",
                "pl": "Zaktualizowano plik package.json, aby dostarczał jsonConfig.json5",
                "uk": "Оновлено package.json для доставки jsonConfig.json5",
                "zh-cn": "更新了 package.json 以提供 jsonConfig.json5"
            },
            "1.0.1": {
                "en": "Documentation got updated",
                "de": "Die Dokumentation wurde aktualisiert",
                "ru": "Документация обновлена",
                "pt": "A documentação foi atualizada",
                "nl": "Documentatie is bijgewerkt",
                "fr": "La documentation a été mise à jour",
                "it": "La documentazione è stata aggiornata",
                "es": "La documentación se actualizó",
                "pl": "Dokumentacja została zaktualizowana",
                "uk": "Документацію оновлено",
                "zh-cn": "文档已更新"
            },
            "1.0.0": {
                "en": "\n Dependencies got updated\n Some fixes to make adapter-checker happy\n Updated git workflows\n Dropped requestJS since it's deprecated\n Replaced requestJS by axios for http requests\n Added Webserver for Push-Service API\n Added adapter-dev support\n Added snyk plugin\n Swapped Admin UI to V5",
                "de": "Abhängigkeiten wurden aktualisiert\n Einige Korrekturen, um den Adapter-Checker glücklich zu machen\n Aktualisierte Git-Workflows\n requestJS wurde gelöscht, da es veraltet ist\n requestJS durch axios für http-Anfragen ersetzt\n Webserver für Push-Service-API hinzugefügt\n Adapter-Dev-Unterstützung hinzugefügt\n Snyk-Plugin hinzugefügt\n Admin-Benutzeroberfläche auf V5 umgestellt",
                "ru": "Зависимости обновлены\n Некоторые исправления, чтобы сделать программу проверки адаптера счастливой\n Обновлены рабочие процессы git.\n Удален requestJS, так как он устарел\n Заменен requestJS на axios для http-запросов.\n Добавлен веб-сервер для Push-Service API\n Добавлена ​​поддержка адаптера-разработчика\n Добавлен сник-плагин\n Пользовательский интерфейс администратора заменен на V5.",
                "pt": "As dependências foram atualizadas\n Algumas correções para deixar o verificador de adaptadores feliz\n Fluxos de trabalho git atualizados\n RequestJS descartado, pois está obsoleto\n Substituído requestJS por axios para solicitações http\n Servidor da Web adicionado para API de serviço push\n Adicionado suporte adaptador-dev\n Plugin snyk adicionado\n UI de administrador trocada para V5",
                "nl": "Afhankelijkheden zijn bijgewerkt\n Enkele oplossingen om adapter-checker blij te maken\n Bijgewerkte git-workflows\n RequestJS verwijderd omdat het verouderd is\n RequestJS vervangen door axios voor http-verzoeken\n Toegevoegd Webserver voor Push-Service API\n Ondersteuning voor adapter-dev toegevoegd\n Snyk-plug-in toegevoegd\n Beheerdersinterface omgewisseld naar V5",
                "fr": "Les dépendances ont été mises à jour\n Quelques correctifs pour rendre le vérificateur d'adaptateur heureux\n Flux de travail git mis à jour\n Abandon de requestJS car il est obsolète\n Remplacement de requestJS par axios pour les requêtes http\n Serveur Web ajouté pour l'API Push-Service\n Ajout de la prise en charge de l'adaptateur-dev\n Plugin snyk ajouté\n Passage de l'interface utilisateur d'administration à la V5",
                "it": "Le dipendenze sono state aggiornate\n Alcune correzioni per rendere felice il controllore dell'adattatore\n Flussi di lavoro git aggiornati\n Dropped requestJS poiché è deprecato\n Sostituito requestJS con axios per le richieste http\n Aggiunto server Web per l'API Push-Service\n Aggiunto supporto adattatore-sviluppo\n Aggiunto plugin snyk\n Interfaccia utente di amministrazione sostituita con V5",
                "es": "Las dependencias se actualizaron\n Algunas correcciones para hacer feliz al verificador de adaptadores\n Flujos de trabajo de git actualizados\n Se eliminó requestJS porque está en desuso\n Se reemplazó requestJS por axios para solicitudes http\n Servidor web agregado para API de servicio de inserción\n Se agregó compatibilidad con adaptador-dev\n Complemento snyk agregado\n Interfaz de usuario de administrador intercambiada a V5",
                "pl": "Zależności zostały zaktualizowane\n Kilka poprawek, aby uszczęśliwić adapter-checker\n Zaktualizowano przepływy pracy git\n Usunięto requestJS, ponieważ jest przestarzały\n Zastąpiono requestJS przez axios dla żądań http\n Dodano serwer WWW dla interfejsu API Push-Service\n Dodano obsługę adapter-dev\n Dodano wtyczkę snyk\n Zmieniono interfejs administratora na V5",
                "zh-cn": "依赖项已更新\n 一些使适配器检查器满意的修复\n 更新了 git 工作流程\n 删除了 requestJS，因为它已被弃用\n 将 http 请求的 requestJS 替换为 axios\n 添加了用于推送服务 API 的 Web 服务器\n 添加了适配器开发支持\n 添加了 snyk 插件\n 将管理 UI 切换至 V5",
                "uk": "Залежності оновлено\n Деякі виправлення для задоволення перевірки адаптера\n Оновлені робочі процеси git\n Вилучено requestJS, оскільки він застарів\n Замінено requestJS на axios для http-запитів\n Додано веб-сервер для Push-Service API\n Додана підтримка adapter-dev\n Додано плагін snyk\n Інтерфейс адміністратора замінено на V5"
            }
        },
        "titleLang": {
            "en": "Robonect HX",
            "de": "Robonect HX",
            "ru": "Робонект HX",
            "pt": "Robonect HX",
            "nl": "Robonect HX",
            "fr": "Robonect HX",
            "it": "Robonect HX",
            "es": "Robonect HX",
            "pl": "Robonect HX",
            "uk": "Robonect HX",
            "zh-cn": "Robonect HX"
        },
        "desc": {
            "en": "Robonect HX for lawn mower robots from Husquarna, Flymo, McCulloch and Gardena",
            "de": "Robonect HX für Rasenmäherroboter von Husquarna, Flymo, McCulloch und Gardena",
            "ru": "Robonect HX для роботов-газонокосилок от Husquarna, Flymo, McCulloch и Gardena",
            "pt": "Robonect HX para robôs cortadores de grama da Husquarna, Flymo, McCulloch e Gardena",
            "nl": "Robonect HX voor grasmaaierrobots van Husquarna, Flymo, McCulloch en Gardena",
            "fr": "Robonect HX pour les robots tondeuses Husquarna, Flymo, McCulloch et Gardena",
            "it": "Robonect HX per robot tosaerba di Husquarna, Flymo, McCulloch e Gardena",
            "es": "Robonect HX para robots cortacésped de Husquarna, Flymo, McCulloch y Gardena",
            "pl": "Robonect HX do robotów koszących Husquarna, Flymo, McCulloch i Gardena",
            "uk": "Robonect HX для роботів-газонокосарок Husquarna, Flymo, McCulloch і Gardena",
            "zh-cn": "Robonect HX 适用于 Husquarna、Flymo、McCulloch 和 Gardena 割草机机器人"
        },
        "mode": "daemon",
        "materialize": true,
        "compact": true,
        "platform": "Javascript/Node.js",
        "loglevel": "info",
        "connectionType": "local",
        "dataSource": "push",
        "icon": "robonect.png",
        "enabled": false,
        "extIcon": "https://raw.githubusercontent.com/Grizzelbee/ioBroker.robonect/master/admin/robonect.png",
        "keywords": [
            "robonect",
            "lawn mower"
        ],
        "localLinks": {
            "_default": "http://%robonectIp%"
        },
        "readme": "https://github.com/Grizzelbee/ioBroker.robonect/blob/master/README.md",
        "authors": [
            "grizzelbee <open.source@hingsen.de>",
            "braindead1 <os.braindead1@gmail.com>",
            "StefSign <hufnagl@hotmail.com>"
        ],
        "type": "garden",
        "tier": 2,
        "license": "MIT",
        "adminUI": {
            "config": "json"
        },
        "globalDependencies": [
            {
                "admin": ">=5.1.13"
            }
        ],
        "dependencies": [
            {
                "js-controller": ">=3.0.0"
            }
        ],
        "plugins": {
            "sentry": {
                "dsn": "https://a0c2e8d5451b4c45240850edba5e25d1@o505019.ingest.sentry.io/4505709924253696"
            }
        },
        "messages": [
            {
                "condition": {
                    "operand": "and",
                    "rules": [
                        "oldVersion<1.0.0",
                        "newVersion>=1.0.0"
                    ]
                },
                "title": {
                    "en": "Instance requires new configuration after update",
                    "de": "Die Instanz erfordert nach dem Update eine neue Konfiguration",
                    "ru": "Экземпляр требует новой конфигурации после обновления",
                    "pt": "A instância requer uma nova configuração após a atualização",
                    "nl": "Instantie vereist nieuwe configuratie na update",
                    "fr": "L'instance nécessite une nouvelle configuration après la mise à jour",
                    "it": "L'istanza richiede una nuova configurazione dopo l'aggiornamento",
                    "es": "La instancia requiere una nueva configuración después de la actualización",
                    "pl": "Instancja wymaga nowej konfiguracji po aktualizacji",
                    "zh-cn": "实例更新后需要新配置",
                    "uk": "Після оновлення екземпляр потребує нової конфігурації"
                },
                "text": {
                    "en": "After upgrading to Version 1.0.0 or later you need to reenter your password and check your configuration settings due to the change of the admin interface.",
                    "de": "Nach dem Upgrade auf Version 1.0.0 oder höher müssen Sie aufgrund der Änderung der Admin-Oberfläche Ihr Passwort erneut eingeben und Ihre Konfigurationseinstellungen überprüfen.",
                    "ru": "После обновления до версии 1.0.0 или более поздней вам необходимо повторно ввести пароль и проверить параметры конфигурации в связи с изменением интерфейса администратора.",
                    "pt": "Depois de atualizar para a versão 1.0.0 ou posterior, você precisa digitar novamente sua senha e verificar suas definições de configuração devido à alteração da interface de administração.",
                    "nl": "Na het upgraden naar versie 1.0.0 of later moet u uw wachtwoord opnieuw invoeren en uw configuratie-instellingen controleren vanwege de wijziging van de beheerdersinterface.",
                    "fr": "Après la mise à niveau vers la version 1.0.0 ou ultérieure, vous devez ressaisir votre mot de passe et vérifier vos paramètres de configuration en raison du changement de l'interface d'administration.",
                    "it": "Dopo l'aggiornamento alla versione 1.0.0 o successiva è necessario reinserire la password e controllare le impostazioni di configurazione a causa della modifica dell'interfaccia di amministrazione.",
                    "es": "Después de actualizar a la versión 1.0.0 o posterior, debe volver a ingresar su contraseña y verificar sus ajustes de configuración debido al cambio de la interfaz de administración.",
                    "pl": "Po aktualizacji do wersji 1.0.0 lub nowszej należy ponownie wprowadzić hasło i sprawdzić ustawienia konfiguracyjne ze względu na zmianę interfejsu administratora.",
                    "uk": "Після оновлення до версії 1.0.0 або новішої вам потрібно повторно ввести пароль і перевірити налаштування конфігурації через зміну інтерфейсу адміністратора.",
                    "zh-cn": "升级到版本1.0.0或更高版本后，由于管理界面的更改，您需要重新输入密码并检查您的配置设置。"
                },
                "level": "warn",
                "buttons": [
                    "agree",
                    "cancel"
                ]
            }
        ]
    },
    "native": {
        "username": "",
        "password": "",
        "robonectIp": "",
        "pushService": false,
        "pushServiceIp": "192.168.x.x",
        "pushServicePort": 55443,
        "statusInterval": 60,
        "infoInterval": 900,
        "restPeriod1Start": "",
        "restPeriod1End": "",
        "restPeriod2Start": "",
        "restPeriod2End": "",
        "batteryPollType": "Status",
        "doorPollType": "NoPoll",
        "errorsPollType": "Info",
        "extensionPollType": "NoPoll",
        "gpsPollType": "NoPoll",
        "hoursPollType": "Info",
        "motorPollType": "Info",
        "portalPollType": "Info",
        "pushPollType": "Info",
        "timerPollType": "Info",
        "versionPollType": "Info",
        "weatherPollType": "NoPoll",
        "wlanPollType": "Info"
    },
    "encryptedNative": [
        "password"
    ],
    "protectedNative": [
        "Password"
    ],
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Connected to lawn mower",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "last_sync",
            "type": "state",
            "common": {
                "name": "Last synchronization",
                "type": "string",
                "role": "state",
                "read": true,
                "write": false,
                "desc": ""
            },
            "native": {}
        },
        {
            "_id": "online",
            "type": "state",
            "common": {
                "name": "Mower is online",
                "type": "boolean",
                "role": "state",
                "read": true,
                "write": false,
                "desc": ""
            },
            "native": {}
        },
        {
            "_id": "rest_time",
            "type": "state",
            "common": {
                "name": "Current poll is in rest time",
                "type": "boolean",
                "role": "state",
                "read": true,
                "write": false,
                "desc": ""
            },
            "native": {}
        }
    ]
}
